print('Задача 9. Недоделка')

# Вы пришли на работу в контору по разработке игр,
# целевая аудитория которых - дети и их родители.
#
# У прошлого программиста было задание
# сделать две игры в одном приложении, чтобы пользователь мог выбирать одну из них.
#
# Однако программист, на место которого вы пришл
# и, перед увольнением не успел сделать эту задачу и оставил только небольшой шаблон проекта.
#
# Используя этот шаблон,
# реализуйте игры «Камень, ножницы, бумага» и «Угадай число».
#
# Правила игры «Камень, ножницы, бумага»:
# программа запрашивает у пользователя строку
# и выводит победил он или проиграл.
#
# Камень бьёт ножницы, ножницы режут бумагу, бумага кроет камень.
#
# Правила игры “Угадай число”:
# программа запрашивает у пользователя число до тех пор, пока он его не отгадает.


def rock_paper_scissors():
    #Здесь будет игра "Камень, ножницы, бумага"
    prog_value = 'камень'
    print('\nИгра \"Камень, ножницы, бумага\"')
    user_value = input('Введите ваш выбор: ')
    if prog_value == user_value:
        print('Ничья!')
    elif user_value == 'ножницы':
        print('Вы проиграли!')
    elif user_value == 'бумага':
        print('Вы выиграли!')


def guess_the_number():
    #Здесь будет игра "Угадай число"
    prog_value = 13
    print('\nИгра \"Угадай число\"')
    while True:
        user_value = int(input('Введите число: '))
        if user_value == prog_value:
            print('Угадали!')
            break
        else:
            print('Не угадали!')
        print()


def mainMenu():
    #Здесь главное меню игры
    while True:
        print('\nВыберите игру: ')
        print('1 - Камень, ножницы, бумага')
        print('2 - Угадай число')
        print('0 - Выход')
        choice = int(input('Выбор игрока: '))

        if choice == 1:
            rock_paper_scissors()
        elif choice == 2:
            guess_the_number()
        elif choice == 0:
            break


mainMenu()
