print('Задача 8. НОД')

#Напишите функцию, вычисляющую наибольший общий делитель двух чисел


def devider(x, y):
    for i in range(min(x, y), 1, -1):
        if x % i == 0 and y % i == 0:
            print(f'Наибольший общий делитель чисел {x} и {y} равен {i}')
            break


x = int(input('Введите первое число: '))
y = int(input('Введите второе число: '))
devider(x, y)
