print('Задача 5. Текстовый редактор')

# Мы продолжаем разрабатывать новый текстовый редактор,
# и в этот раз нам поручили написать для него код,
# который считает количество любой буквы
# и любой цифры в тексте (а не только буквы Ы как раньше).
#
# Напишите функцию count_letters,
# которая принимает на вход текст и подсчитывает,
# какое в нём количество цифр K и букв N.
#
# Функция должна вывести на экран информацию
# о найденных буквах и цифрах в определенном формате.
#
# Пример:
# Введите текст: 100 лет в обед
# Какую цифру ищем? 0
# Какую букву ищём? л
#
# Количество цифр 0: 2
# Количество букв л: 1


def count_letters(text, number, char):
    count_number = 0
    count_char = 0

    for i in text:
        if i == number:
            count_number += 1
        elif i == char:
            count_char += 1
    print()
    print(f'Количество цифр {number}: {count_number}')
    print(f'Количество букв {char}: {count_char}')


text = input('Введите тект: ')
number = input('Какую цифру ищем? ')
char = input('Какую букву ищем? ')
count_letters(text, number, char)
